Left-Hand/Yumud/targets/N32G45X/.pack/Nationstech/N32G45x_DFP.1.0.5/Nationstech.N32G45x_DFP.1.0.5.pdsc
        <condition id="N32G45x CMSIS Device">            <!-- conditions selecting Devices -->
            <description>Nationstech N32G45x Series devices</description>
            <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
            <require Dvendor="Nationstech:927" Dname="N32*"/>
        </condition>

        <condition id="N32G45x STDPERIPH">
            <description>Nationstech N32G45x Standard Peripherals Drivers</description>
            <require condition="N32G45x CMSIS Device"/>
            <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework"/>
        </condition>

        <condition id="N32G45x STDPERIPH RCC">
            <description>Nationstech N32G45x Standard Peripherals Drivers with RCC</description>
            <require condition="N32G45x STDPERIPH"/>
            <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RCC"/>
        </condition>

        <condition id="N32G45x Algorithm Common" >
            <description>Nationstech N32G45x Series Algorithm Libraries Common Functions.</description>
            <require condition="N32G45x CMSIS Device"/>
            <require Cclass ="Device" Cgroup="Algorithm Libs" Csub="Common"/>
        </condition>

    </conditions>

    <components>
        <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="N32G45x CMSIS Device">
            <description>Startup File for Nationstech N32G45x Series</description>
            <files>
                <!--  include folder -->
                <file category="include" name="firmware/CMSIS/device/"/>
                <file category="source" name="firmware/CMSIS/device/startup/startup_n32g45x.s" attr="config" condition="N32G45x CMSIS Device" version="1.0.0"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="../system_N32G45x" Cversion="1.0.0" condition="N32G45x CMSIS Device">
            <description>System Clock Config File for Nationstech N32G45x</description>
            <files>
                <!--  include folder -->
                <file category="include" name="firmware/CMSIS/device/"/>
                <file category="source" name="firmware/CMSIS/device/system_n32g45x.c" attr="config" version="1.0.0"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework" Cversion="1.0.0" condition="N32G45x STDPERIPH">
            <description>Standard Peripherals Drivers Framework</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_FRAMEWORK
            </RTE_Components_h>
            <files>
                <file category="include" name="firmware/n32g45x_std_periph_driver/inc/"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/misc.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="WWDG" Cversion="1.0.0" condition="N32G45x STDPERIPH RCC">
            <description>Window watchdog (WWDG) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_WWDG
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_wwdg.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_wwdg.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="USART" Cversion="1.0.0" condition="N32G45x STDPERIPH RCC">
            <description>Universal synchronous asynchronous receiver transmitter (USART) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_USART
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_usart.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_usart.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="TIMER" Cversion="1.0.0" condition="N32G45x STDPERIPH RCC">
            <description>Timers (TIMER) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_TIM
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_tim.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_tim.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SPI" Cversion="1.0.0" condition="N32G45x STDPERIPH RCC">
            <description>Serial peripheral interface (SPI) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_SPI
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_spi.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_spi.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SDIO" Cversion="1.0.0" condition="N32G45x STDPERIPH RCC">
            <description>Secure digital (SDIO) interface driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_SDIO
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_sdio.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_sdio.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="ADC" Cversion="1.0.0" condition="N32G45x STDPERIPH RCC">
            <description>Analog-to-digital converter (ADC) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_ADC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_adc.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_adc.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="BKP" Cversion="1.0.0" condition="N32G45x STDPERIPH RCC">
            <description>Backup registers (BKPR) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_BKP
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_bkp.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_bkp.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CAN" Cversion="1.0.0" condition="N32G45x STDPERIPH RCC">
            <description>Controller area network (CAN) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_CAN
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_can.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_can.c"/>
            </files>
        </component>

