Left-Hand/Yumud/targets/N32G45X/.pack/Nationstech/N32G45x_DFP.1.0.5/Nationstech.N32G45x_DFP.1.0.5.pdsc
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="ETH" Cversion="1.0.0" condition="N32G45x STDPERIPH RCC">
            <description>Ethernet MAC (ETH) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_ETH
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_eth.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_eth.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DVP" Cversion="1.0.0" condition="N32G45x STDPERIPH RCC">
            <description>Digital video port (DVP) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DVP
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_dvp.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_dvp.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="COMP" Cversion="1.0.0" condition="N32G45x STDPERIPH RCC">
            <description>Comparator (COMP) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_COMP
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_comp.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_comp.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="OPAMP" Cversion="1.0.0" condition="N32G45x STDPERIPH RCC">
            <description>Operational amplifier (OPAMP) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_OPAMP
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_opamp.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_opamp.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="QSPI" Cversion="1.0.0" condition="N32G45x STDPERIPH RCC">
            <description>Queued SPI (QSPI) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_QSPI
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_qspi.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_qspi.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="USBDEV" Cversion="1.0.0" condition="N32G45x STDPERIPH RCC">
            <description>USB device (USBDEV) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_USBDEV
            </RTE_Components_h>
            <files>
                <file category="include" name="firmware/n32g45x_usbfs_driver/inc" />
                <file category="header" name="firmware/n32g45x_usbfs_driver/inc/usb_core.h"/>
                <file category="header" name="firmware/n32g45x_usbfs_driver/inc/usb_def.h"/>
                <file category="header" name="firmware/n32g45x_usbfs_driver/inc/usb_init.h"/>
                <file category="header" name="firmware/n32g45x_usbfs_driver/inc/usb_int.h"/>
                <file category="header" name="firmware/n32g45x_usbfs_driver/inc/usb_lib.h"/>
                <file category="header" name="firmware/n32g45x_usbfs_driver/inc/usb_mem.h"/>
                <file category="header" name="firmware/n32g45x_usbfs_driver/inc/usb_regs.h"/>
                <file category="header" name="firmware/n32g45x_usbfs_driver/inc/usb_sil.h"/>
                <file category="header" name="firmware/n32g45x_usbfs_driver/inc/usb_type.h"/>
                <file category="source" name="firmware/n32g45x_usbfs_driver/src/usb_core.c"/>
                <file category="source" name="firmware/n32g45x_usbfs_driver/src/usb_init.c"/>
                <file category="source" name="firmware/n32g45x_usbfs_driver/src/usb_int.c"/>
                <file category="source" name="firmware/n32g45x_usbfs_driver/src/usb_mem.c"/>
                <file category="source" name="firmware/n32g45x_usbfs_driver/src/usb_regs.c"/>
                <file category="source" name="firmware/n32g45x_usbfs_driver/src/usb_sil.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="Algorithm Libs" Csub="Common" Cversion="1.0.0" condition="N32G45x CMSIS Device">
            <RTE_Components_h>
        #define RTE_DEVICE_ALGO_COMMON
            </RTE_Components_h>
            <files>
                <file category="include" name="firmware/n32g45x_algo_lib/inc" />
                <file category="header" name="firmware/n32g45x_algo_lib/inc/n32g45x_algo_common.h"/>
                <file category="source" name="firmware/n32g45x_algo_lib/lib/n32g45x_algo_common.lib"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="Algorithm Libs" Csub="AES" Cversion="1.0.0" condition="N32G45x Algorithm Common">
            <RTE_Components_h>
        #define RTE_DEVICE_ALGO_AES
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_algo_lib/inc/n32g45x_aes.h"/>
                <file category="source" name="firmware/n32g45x_algo_lib/lib/n32g45x_aes.lib"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="Algorithm Libs" Csub="DES" Cversion="1.0.0" condition="N32G45x Algorithm Common">
            <RTE_Components_h>
        #define RTE_DEVICE_ALGO_DES
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_algo_lib/inc/n32g45x_des.h"/>
                <file category="source" name="firmware/n32g45x_algo_lib/lib/n32g45x_des.lib"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="Algorithm Libs" Csub="RNG" Cversion="1.0.0" condition="N32G45x Algorithm Common">
            <RTE_Components_h>
        #define RTE_DEVICE_ALGO_RNG
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_algo_lib/inc/n32g45x_rng.h"/>
                <file category="source" name="firmware/n32g45x_algo_lib/lib/n32g45x_rng.lib"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="Algorithm Libs" Csub="HASH" Cversion="1.0.0" condition="N32G45x Algorithm Common">
            <RTE_Components_h>
        #define RTE_DEVICE_ALGO_HASH
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_algo_lib/inc/n32g45x_hash.h"/>
                <file category="source" name="firmware/n32g45x_algo_lib/lib/n32g45x_hash.lib"/>
            </files>
        </component>
    </components>
</package>
